OpenFOAM/ToyProblem1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       999;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       1000;
    }
    left
    {
        type            empty;
        nFaces          1000;
        startFace       1001;
    }
    right
    {
        type            empty;
        nFaces          1000;
        startFace       2001;
    }
    frontAndBack
    {
        type            empty;
        nFaces          2000;
        startFace       3001;
    }
)


// ************************************************************************* //
