OpenFOAM/ToyProblem1/0/base_U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 -0.394688351072542 0);


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 -0.394688351072542 0);
    }
    outlet
    {
        type            zeroGradient;
//        type            advective;
//        phi             phi;
//        rho	            rho;
//        fieldInf	      (0 -0.394688351072542 0);
//        lInf	          4;
//        value           uniform (0 -0.394688351072542 0);
//        type                matchedFlowRateOutletVelocity;
//        inletPatch          inlet;
//        value               uniform (0 -0.394688351072542 0);
//        value               uniform (0 -0.166509148108728 0);
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
