OpenFOAM/ToyProblem1/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
1000
(
2.37037037037037
2.37037037037037
2.37037037037037
2.37037037037037
2.37037037037037
2.37037037037037
2.37037037037037
2.37037037037037
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
        type            calculated;
        value           uniform 2.37037037037037;
    }
    left
    {
        type            empty;
    }
    right
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
